In [ ]:
- pandas : Used for Data base reading writing Modifying the data

- numpy : used for Numerical or math operations

- matplotlib : Used for plotting

- Seaborn : used for plotting

In [ ]:
**Step-1 : Import pandas as pd**

**step-2: Create Dataframe using list**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,coloumn)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

In [5]:
data=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,coloumn)
pd.DataFrame(data)

         0
0   Ramesh
1   Suresh
2  Sathish

**step-3: Add column**

In [7]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,coloumn)
pd.DataFrame(names,columns=['Names'])

     Names
0   Ramesh
1   Suresh
2  Sathish

**step-4: Update the index**

In [8]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,coloumn)
pd.DataFrame(names,index=['A'])

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

In [9]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,coloumn)
pd.DataFrame(names,index=['A', 'B', 'C'])

         0
A   Ramesh
B   Suresh
C  Sathish

In [10]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,coloumn)
pd.DataFrame(names, columns=['Names'],index=['A', 'B', 'C'])

     Names
A   Ramesh
B   Suresh
C  Sathish

In [11]:
names=['Ramesh', 'Suresh', 'Sathish']
cols=['Names']
idx=['A', 'B', 'C']
pd.DataFrame(names,
             index=idx,
            columns=cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

step-5: create a DataFrame with Multiple colunms**

In [12]:
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
cols=['Names', 'City']
idx=['A', 'B', 'C']
pd.DataFrame(names,
             index=idx,
            columns=cols)

ValueError: Shape of passed values is (3, 1), indices imply (3, 2)

In [13]:
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=[names, city]
cols=['Names', 'City']
idx=['A', 'B', 'C']
pd.DataFrame(data)

        0       1        2
0  Ramesh  Suresh  Sathish
1     Hyd  Mumbai      Blr

In [15]:
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=[names, city]
cols=['Names', 'City']
idx=['A', 'B', 'C']
pd.DataFrame(data,index=cols, columns=idx).T

     Names    City
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [17]:
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=zip(names, city)
cols=['Names', 'City']
idx=['A', 'B', 'C']
pd.DataFrame(data,index=idx, columns=cols)

     Names    City
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [21]:
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
age=[20,22.24]
data=zip(names, city, age)
cols=['Names', 'City', 'Age']
idx=['A', 'B', 'C']
pd.DataFrame(data,index=idx, columns=cols)

ValueError: Length of values (2) does not match length of index (3)

**step-6 : how to add data to empty dataframe**

In [25]:
l=[]
l.append(20)
l

d={}
d['Names']=['Ramesh', 'Suresh', 'Sathish']
print(d)

S=' '
S=S+'apple'
S

NameError: name 'Ramesh' is not defined

In [ ]:
df=pd.DataFrame()
df['Names']=['Ramesh', 'Suresh', 'Sathish']
df['Age']=[20,22,24]

**step-7: Create a dataframe using dictionary**

In [28]:
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

**step-8: methods** 

- shape

- size

- columns

- dtypes

-isnull

In [ ]:
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d, '2','4')
df

In [30]:
df.shape

(3, 3)

In [31]:
df.size

9

In [32]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [33]:
df.dtypes

Names    object
Age       int64
City     object
dtype: object

In [34]:
df.isnull

<bound method DataFrame.isnull of      Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr>

In [35]:
df.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False

In [36]:

# column wise null valuse not available 
df.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

**step-9 - How to rename the columns**

In [ ]:
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df

In [37]:
# if you need to rename all the columns
df.columns=['A', 'B', 'C']
df

         A   B       C
0   Ramesh  20     Hyd
1   Suresh  22  Mumbai
2  Sathish  24     Blr

In [38]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [39]:
df.index=['A', 'B', 'C']
df

         A   B       C
A   Ramesh  20     Hyd
B   Suresh  22  Mumbai
C  Sathish  24     Blr

In [ ]:
#df.rename(mapper,index,columns,axis,inplace)

In [40]:
d={'Names': 'A', 'Age':'B', 'City': 'C'}
df.rename(d)

         A   B       C
A   Ramesh  20     Hyd
B   Suresh  22  Mumbai
C  Sathish  24     Blr

In [41]:
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [42]:
d={'Names': 'A', 'Age':'B', 'City': 'C'}
df.rename(d)

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [44]:
d={'Names': 'A', 'Age':'B', 'City': 'C'}
df.rename(columns=d, inplace=True)

In [ ]:
# I want to change my columns
# I provide dictionary of a mapper with new columns
# i want to fed a food for you
# I prepared food

In [46]:
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df.rename(index=d, inplace=True)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [45]:
df.rename(index=d, inplace=True)

In [47]:
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
d={0:'A', 1:'B', 2:'C'}
df=pd.DataFrame(d)
df.rename(index=d, inplace=True)
df

ValueError: If using all scalar values, you must pass an index

In [ ]:
# df.rename(mapper )

**22.05.2025  --- repeated**

In [ ]:
- pandas : used for Data base reading writing Modify the data

- numpy : used for Numerical or math operations

- matplotlib : used for plotting 

- seaborn : used for plotting 

-

**step-1: Import packages**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create DataFrame using List**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

In [4]:
data=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(data)

         0
0   Ramesh
1   Suresh
2  Sathish

**step-3: Add Column**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names, 'Names')    # error will come --- to overcome errot change pd.DataFrame(names, columns=['Names'])

TypeError: Index(...) must be called with a collection of some kind, 'Names' was passed

In [8]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names, columns=['Names'])

     Names
0   Ramesh
1   Suresh
2  Sathish

**step-4: update the index**

In [9]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names, index=['A'])  # error will come

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

In [10]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names, index=['A', 'B', 'C'])

         0
A   Ramesh
B   Suresh
C  Sathish

In [12]:
names=['Ramesh', 'Suresh', 'Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,columns=['Names'], index=['A', 'B', 'C'])

     Names
A   Ramesh
B   Suresh
C  Sathish

In [13]:
names=['Ramesh', 'Suresh', 'Sathish']
cols=['Names']
idx=['A', 'B', 'C']
pd.DataFrame(names,
             index=idx,
             columns=cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

**step-5: Create a DataFrame with multiple columns**

In [9]:
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=[names, city]
cols=['Names','City']
idx=['A', 'B', 'C']
pd.DataFrame(data)

        0       1        2
0  Ramesh  Suresh  Sathish
1     Hyd  Mumbai      Blr

In [10]:
# make transpose using .T
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=[names, city]
cols=['Names','City']
idx=['A', 'B', 'C']
pd.DataFrame(data).T

         0       1
0   Ramesh     Hyd
1   Suresh  Mumbai
2  Sathish     Blr

In [11]:
# make transpose using .T
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=[names, city]
cols=['Names','City']
idx=['A', 'B', 'C']
pd.DataFrame(data,index=cols,columns=idx).T

     Names    City
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [13]:
# combaining list===>use zip
# no need transpose (.T) for zip
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
data=zip(names, city)
cols=['Names','City']
idx=['A', 'B', 'C']
pd.DataFrame(data,index=idx,columns=cols)

     Names    City
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [16]:
# add - age
# combaining list===>use zip
names=['Ramesh', 'Suresh', 'Sathish']
city=['Hyd', 'Mumbai', 'Blr']
age=[20,22,24]
data=zip(names, city, age)
cols=['Names','City','Age']
idx=['A', 'B', 'C']
pd.DataFrame(data,index=idx,columns=cols)

     Names    City  Age
A   Ramesh     Hyd   20
B   Suresh  Mumbai   22
C  Sathish     Blr   24

**step-6: How to add data to empty dataframe**

In [18]:
l=[]
l.append(20)
l

[20]

In [29]:
d={}
d['Names']=['Ramesh', 'Suresh', 'Sathish']
print(d)

{'Names': ['Ramesh', 'Suresh', 'Sathish']}

In [20]:
s=''
s=s+'apple'
s

'apple'

In [30]:
df=pd.DataFrame()
df['Names']=['Ramesh', 'Suresh', 'Sathish']
d

{'Names': ['Ramesh', 'Suresh', 'Sathish']}

In [31]:
# your DataFrame becomes as below if apply df
df=pd.DataFrame()
df['Names']=['Ramesh', 'Suresh', 'Sathish']
df

     Names
0   Ramesh
1   Suresh
2  Sathish

In [32]:
# similarly update age
df=pd.DataFrame()
df['Names']=['Ramesh', 'Suresh', 'Sathish']
df['Age']=[20,22,24]
df

     Names  Age
0   Ramesh   20
1   Suresh   22
2  Sathish   24

In [33]:
#similarly update city
df=pd.DataFrame()
df['Names']=['Ramesh', 'Suresh', 'Sathish']
df['Age']=[20,22,24]
df["City"]=['Hyd', 'Mumbai', 'Blr']
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

**Step-7:Create a dataframe using dictionary**

In [34]:
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
d

{'Names': ['Ramesh', 'Suresh', 'Sathish'],
 'Age': [20, 22, 24],
 'City': ['Hyd', 'Mumbai', 'Blr']}

In [35]:
# apply in dataframe  AND DICTIONARY IS EASY, NO NEED TO PROVIDE COLOUMN NAMES 
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [36]:
# update dataframe**
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d,columns=['a', '2', '4'])  ### what happened to date, how to modify column data
df

Empty DataFrame
Columns: [a, 2, 4]
Index: []

In [46]:
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)  ### what happened to date-- there are some methods 
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

**step-8 Methods**

- shape

- size

- columns

- dtypes

- isnull

In [47]:
df.shape

(3, 3)

In [48]:
df.size

9

In [49]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [50]:
df.dtypes  # when we missed the bracket ===>it is bound method

Names    object
Age       int64
City     object
dtype: object

In [57]:
df.isnull() # it is coming false why: if argument is there it will come bound method

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False

In [59]:
# column wise null values
df.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

**step-9: Rename the columns**

In [60]:
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [61]:
# if we want to rename all the column names
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [62]:
df.columns=['A', 'B', 'C']
df

         A   B       C
0   Ramesh  20     Hyd
1   Suresh  22  Mumbai
2  Sathish  24     Blr

In [63]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [65]:
df.index=['A', 'B', 'C']
df

         A   B       C
A   Ramesh  20     Hyd
B   Suresh  22  Mumbai
C  Sathish  24     Blr

In [66]:
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [69]:
# another way to change the columns names
#df.rename(mapper,index,columns,axis,inplace)
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(d)

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [71]:
# another way to change the columns names
#df.rename(mapper,index,columns,axis,inplace)
# if inplace data will overwrite
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(d,inplace=True)  # data not changed why
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [72]:
# I want to change my columns
# I provided dictionary of a mapper with new columns

# I want to feed a food for you
# 

# I want to take you a restarunt
# I prepared a food

#

In [82]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
#df.rename(mapper,index,columns,axis,inplace)
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(index=d,inplace=True)  # no changes 
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [83]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
#df.rename(mapper,index,columns,axis,inplace)
d={0:'A', 1:'B', 2:'C'}  # change names to 0:'A', 1:'B', 2:'C'
df.rename(index=d,inplace=True)
df

     Names  Age    City
A   Ramesh   20     Hyd
B   Suresh   22  Mumbai
C  Sathish   24     Blr

In [ ]:
#df.rename(mapper,index,columns,axis,inplace)
d={0:'A', 1:'B', 2:'C'}  # change names to 0:'A', 1:'B', 2:'C'
df.rename(index=d,inplace=True)
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(columns=d,inplace=True)
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(d,inplace=True) # my python not understanding this mapper belongs to
#index or column
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(columns=d,inplace=True)

d={0:'A', 1:'B', 2:'C'}  # change names to 0:'A', 1:'B', 2:'C'
df.rename(index=d,inplace=True)

In [94]:
d={'Names':['Ramesh', 'Suresh', 'Sathish'],
  'Age':[20,22,24],
  'City':['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(d,inplace=True)
df.rename(d,
         axis=1,
         inplace=True)
df
# this guy used mapper
# also he told me that it is a column mapper axis=1

         A   B       C
0   Ramesh  20     Hyd
1   Suresh  22  Mumbai
2  Sathish  24     Blr

**23.05.2025**

**step-10: How to add a new data to existed dataframe**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
# df.rename(mapper,index,columns,axis,inplace)
d={'Names':'A', 'Age':'B', 'City':'C'}
df.rename(index=d,inplace=True)
df

     Names  Age    City
0   Ramesh   20     Hyd
1   Suresh   22  Mumbai
2  Sathish   24     Blr

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
#adding a new column data will be updated 
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df['Marks']=[100,200,300]
df

     Names  Age    City  Marks
0   Ramesh   20     Hyd    100
1   Suresh   22  Mumbai    200
2  Sathish   24     Blr    300

In [6]:
#adding a new column data will be updated 
# by mistakenly if you change the values of 'Age'==> df['Age']=[100,200,300] it will also update
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df['Marks']=[100,200,300] # adding a new column
df['Age']=[100,200,300] # modifying the xisting column
df

     Names  Age    City  Marks
0   Ramesh  100     Hyd    100
1   Suresh  200  Mumbai    200
2  Sathish  300     Blr    300

**step-11: Save the dataframe**
- if we want to read or write we need 3 values

    - where you want to save 

    - on which name you want to save

    - on which format you want to save

- filename.txt

- filename.csv or filename.xlsx

- if I provide only file name it will save at current working directory cwd

In [7]:
df

     Names  Age    City  Marks
0   Ramesh  100     Hyd    100
1   Suresh  200  Mumbai    200
2  Sathish  300     Blr    300

In [14]:
df.to_csv('data.csv',index=False)
df.to_csv(r'D:\ABDUL HADI FILE BEFORE INSTALL PYTHON -01.09.2024\data.csv')

**Step-12:Read the dataframe**

In [15]:
pd.read_csv('data.csv')

     Names  Age    City  Marks
0   Ramesh  100     Hyd    100
1   Suresh  200  Mumbai    200
2  Sathish  300     Blr    300

In [17]:
df.to_excel('data.xlsx',index=False)

In [19]:
pd.read_excel('data.xlsx')

     Names  Age    City  Marks
0   Ramesh  100     Hyd    100
1   Suresh  200  Mumbai    200
2  Sathish  300     Blr    300

**23.05.2025**

**step-10 : how to add a new data to existed dataframe**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

d={'Names': ['Ramesh', 'Suresh', 'Sathish'],
'Age':[20,22,24],
'City': ['Hyd', 'Mumbai', 'Blr']}
df=pd.DataFrame(d)
df['Marks']=[100,200,300]
df['Age']=[100,200,300]
df

     Names  Age    City  Marks
0   Ramesh  100     Hyd    100
1   Suresh  200  Mumbai    200
2  Sathish  300     Blr    300

**step-11: save the dataframe** 

- if we want to read or write we need 3 values

- where you want to save

- on which name you want to save 

- on which format you want to save 

- filename.txt

- filename.csv or filename.xlsx

- if I provide only file name it will save at cwd

- C:/users

df

In [3]:
df.to_csv('data.csv')

In [13]:
df.to_csv(r'D:\NARESH IT - PYTHON ASSIGNMENTS FROM MR OMKA-07.04.2025\data.csv')

In [ ]:
step-2 read the dataframe

In [9]:
pd.read_csv('data.csv')

   Unnamed: 0    Names  Age    City  Marks
0           0   Ramesh  100     Hyd    100
1           1   Suresh  200  Mumbai    200
2           2  Sathish  300     Blr    300

In [12]:
df.to_csv('data.csv',index=False)

In [17]:
df.to_excel('data.xlsx',index=False)

ModuleNotFoundError: No module named 'openpyxl'

In [18]:
pd.read_excel('data.xlsx')

FileNotFoundError: [Errno 2] No such file or directory: 'data.xlsx'